from aiogram.utils.markdown import hlink

# hello_url = hlink("Привет, я твой личный помошник", "https://youtu.be/dQw4w9WgXcQ")

# # newpcomers
# dev_url = hlink("Страничка новичка - разработчика БАРС Груп",
#                 "https://conf.bars.group/pages/viewpage.action?pageId=183236087")
# an_url = hlink("Страничка новичка - аналитка БАРС Груп",
#                "https://conf.bars.group/pages/viewpage.action?pageId=198277483")
# newpie_utl = hlink("Страничка новичка БАРС Груп", "https://conf.bars.group/pages/viewpage.action?pageId=121640225")
# newjkx_url = hlink("Страничка новичка БЦ ЖКХ,СЗ и СТРК","https://conf.bars.group/pages/viewpage.action?pageId=183236064")

# templates_url = hlink("ссылке", "https://conf.bars.group/pages/viewpage.action?pageId=56479927")
# references_url = hlink("ссылке", "https://jira.bars.group/servicedesk/customer/portal/13/group/101")
# # vacation etc.
# sickleave_url = hlink("больничный",
#                       "https://conf.bars.group/pages/viewpage.action?pageId=183237343&preview=/183237343/230693376/%D0%98%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D0%B8%D1%8F%20%D0%B1%D0%BE%D0%BB%D1%8C%D0%BD%D0%B8%D1%87%D0%BD%D1%8B%D0%B9.docx")
# vacation_url = hlink("отпуск",
#                      "https://conf.bars.group/pages/viewpage.action?pageId=183237343&preview=/183237343/213452260/%D0%A1%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BE%D1%82%D0%BF%D1%83%D1%81%D0%BA%D0%B0.docx")

# # bonus
# dms_url = hlink("ссылке", "https://conf.bars.group/pages/viewpage.action?pageId=167862245")
# referalprogram_url = hlink("тут", "https://conf.bars.group/pages/viewpage.action?pageId=167851490")
# code_url = hlink("скидок", "https://t.me/barskodbarsgroup")
# biblio_url = hlink("месте", "https://t.me/barsbiblioteka")

# # services
# pass_url = hlink("тут", "https://jira.bars.group/servicedesk/customer/portal/8/group/49")
# corporateUn_url = hlink("здесь", "https://conf.bars.group/display/UCT")
# personnel_url = hlink("Отдел Кадров", "https://jira.bars.group/servicedesk/customer/portal/13/group/101")
# techsupport_url = hlink("Техническая поддержка", "https://jira.bars.group/servicedesk/customer/portal/11")
# accounting_url = hlink("бухгалетрию", "https://jira.bars.group/servicedesk/customer/portal/13/group/103")

# ideas_url = hlink("сюда", "https://t.me/Suggest_an_idea")




# При запуске:
hello_url = hlink("Привет-привет! Меня зовут БОТ CARGO.RUN. Рад приветствовать тебя. Я помогу тебе найти ответы на твои вопросы. Что тебя интересует?")

# Страничка новичка:
newpie_utl = hlink("Вся информация: Здесь собрана вся информация, которая будет полезна для новичка. Если останутся вопросы, можешь обратиться к наставнику/рукводителю/HR BP")
an_url = hlink("Страничка нового аналитика: ссылка на битрикс - страницу по направлению")
dev_url = hlink("Страничка нового разработчика: ссылка на битрикс - страницу по направлению")

# Документы:
"Здесь собраны самые актуальные документы, которые тебе могут понадобиться"
1. ("Шаблоны:	По этой ссылке ты можешь найти самые акуальные и нужные шаблоны документов - ссылка на битрикс - страницу по направлению (заявления, акты, примеры отчетов и т.п. - собрать")
2. ("Справки:	Что можно заказать по этой ссылке: 2-НДФЛ, копия трудовой книжи/договора, вопрос по отпуску, запрос для военкомата. Обращения обрабатываются в течение 3-х рабочих дней после оформления заявки	должно уходить в виде шаблона - запроса на почту в бухгалтерию")

# Отпуск/Больничный/Отгул: 		
1. ("Отпуск:	Уйти в отпуск так, чтоб тебя потом (не дергали) с оформлением документов - это талант) И мы тебя этому научим	ссылка на битрикс - страницу с инструкцией по оформлению разных видов отпусков (ученический, ежегодный (со всеми нюансами), без сохранения заработной платы)")
2. ("Больничный:	Если есть необходимость взять больничный, то загляни сюда	ссылка на битрикс - страницу с инструкцией по действиям (если можешь работать удаленно из дома, то….. если нужно по-настоящему поболеть, то предупреди того-то, сделай то-то и т.п.")
3. ("Отгул:	ссылка на битрикс - страницу с инструкцией по действиям (если есть переработки за отгул, если есть договоренности, если…. Если нет договоренностей, то отправка на инструкцию и описание отпуска без сохранения з/п)")

# Плюшки:
1. ("Реферальная программа:	Классно работать с друзьями бок о бок! Ты можешь пригласить их к нам и получить за это выплату. Все условия тут	на перспективу (ссылка на битрикс)")
2. ("Партнерские скидки:	Уникальная система скидок от партнеров	на перспективу, может быть, с Эльвирой (ссылка на битрикс)")
3. ("Библиотека:	Большая коллекция профессиональной литературы в одном месте	входит список бумажных книг в библиотеке офиса и могу добавить страничку в Битриксе и накидать туда электронную библиотеку.")
4. ("Шоко-бот:	Инструкция к нашему холодильнику и вкусностям в нём	Ссылка на инструкцию и никнейм Саши в телеграм (или сразу ссылка на его кошелёк в Тиньке)")
5. ("Мерч?: не придумала… с Эльвирой?")

# Службы:	("В БАРС Груп много служб, которые помогают организовывать работу Компании.")
1. ("Бухгалтерия и кадры:	Тебе нужно заказать справку 2-НДФЛ или есть вопросы по начислению ЗП, узнать, сколько дней отпуска, Нужен пакет документов для военкомата, или справка с места работы, кроме того, если у тебя изменились данные личных документов, то со всеми этими вопросами поможет разобраться Бухгалтерия. Ссылка - никнейм Натальи в телеграм")
2. ("Техподдержка:	Дать доступ к серверам, установить технику, подключить VPN...Это лишь малая часть того, чем занимается СТП. Нужна помощь-создай задачу	Ссылка - никнейм Марины в телеграм")
3. ("Пропуск:	Пропуск перестал работать или необходим пропуск на велопарковку? В этом случае необходимо поставить задачу тут: ссылка на нужный ресурс")
4. ("Канц.товары и техника	Необходима канцелярия, техника или мебель: Обратись к ????	Ссылка на нужный ресурс с автоматическими заявками к профильной службе (на электронку), либо на никнейм в телеграме какого-то профильного человека")

# Идеи:
("Если у тебя есть идеи, пиши сюда. Мы обязательно рассмотрим твою идею, а ты получишь классный мерч! Где-то должен быть электронный ящик идей (в вЕдении Карины, например:)")